package tinkoff;

import java.util.Scanner;

/*
Костя подключен к мобильному оператору «Мобайл». Абонентская плата Кости составляет ﻿AA﻿ рублей в месяц. За эту стоимость Костя получает ﻿BB﻿ мегабайт интернет-трафика. Если Костя выйдет за лимит трафика, то каждый следующий мегабайт будет стоить ему ﻿CC﻿ рублей.
Костя планирует потратить ﻿DD﻿ мегабайт интернет-трафика в следующий месяц. Помогите ему сосчитать, во сколько рублей ему обойдется интернет.

Формат входных данных
Вводится ﻿44﻿ целых положительных числа ﻿A, B, C, D (1\leq A, B, C, D \leq100)A,B,C,D(1≤A,B,C,D≤100)﻿ — стоимость тарифа Кости, размер тарифа Кости, стоимость каждого лишнего мегабайта, размер интернет-трафика Кости в следующем месяце. Числа во входном файле разделены пробелами.

Формат выходных данных
Выведите одно натуральное число — суммарные расходы Кости на интернет.

Замечание
В первом примере Костя сначала оплатит пакет интернета, после чего потратит на ﻿55﻿ мегабайт больше, чем разрешено по тарифу. Следовательно, за ﻿55﻿ мегабайт он дополняет отдельно, получившаяся стоимость ﻿100+12\times6=160100+12×6=160﻿ рублей.
Во втором примере Костя укладывается в тарифный план, поэтому платит только за него.

Примеры данных
Пример 1
100  10  12  15
вывод
160
Пример 2
100  10  12  1
вывод
100

 */
public class MobileOperator {

    public static void main(String[] args) {

        System.out.print("");
        Scanner in = new Scanner(System.in);

        int a = 0;
        int b = 0;
        int c = 0;
        int d ;

        for (int i = 0; i < 4; i++) {
            if (i == 0) {
                a = in.nextInt();
                if (a < 1 || a > 100) {
                    return;
                }
            } else if (i == 1) {
                b = in.nextInt();
                if (b < 1 || b > 100) {
                    return;
                }
            } else if (i == 2) {
                c = in.nextInt();
                if (c < 1 || c > 100) {
                    return;
                }
            } else {
                d = in.nextInt();
                if (d < 1 || d > 100) {
                    return;
                }
                if (d > b) {
                    System.out.println(a + ((d - b) * c));
                } else {
                    System.out.println(a);
                }
            }
        }
    }
}
